app/controllers/artikels_controller.rb

SELECT "artikels".* FROM "artikels"  ORDER BY created_at DESC
SELECT "games".* FROM "games"  ORDER BY score DESC
---
	def index
		@artikels = Artikel.all.order("created_at DESC")
		@artikel_days = @artikels.group_by{|a| a.created_at.beginning_of_day}
		@games = Game.all.order("score DESC")

INSERT INTO "artikels" ("title", "description", "subtitle", "tag", "platform", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@artikel = current_user.artikel.build(artikel_params)
		@artikel.user_id = current_user.id
		if @artikel.save