app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
	def index
		@games = Game.all

INSERT INTO "games" ("title", "description", "subtitle", "tag", "platform", "score", "release_date", "user_id", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@game = current_user.game.build(game_params)
		@game.user_id = current_user.id
		if @game.save

UPDATE "games" SET "score" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["score", 6.0], ["updated_at", "2016-09-22 02:01:53.883190"], ["id", 2]]
---
	def update
		@game = Game.friendly.find(params[:id])
		if @game.update(game_params)

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 3]]
---
		def find_post
			@game = Game.find(params[:id])