app/controllers/owns_controller.rb

INSERT INTO "owns" ("game_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["game_id", 1], ["user_id", 1], ["created_at", "2016-09-22 10:42:11.567462"], ["updated_at", "2016-09-22 10:42:11.567462"]]
---
    def create

	    @own = current_user.owns.build(:game_id => params[:game_id])
	    if @own.save

SELECT  "owns".* FROM "owns" WHERE "owns"."user_id" = ? AND "owns"."id" = ? LIMIT 1  [["user_id", 1], ["id", 0]]
DELETE FROM "owns" WHERE "owns"."id" = ?  [["id", 1]]
---
    def destroy
	    @own = current_user.owns.find(params[:id])
	    @own.destroy