app/controllers/wishlist_controller.rb

	 def create

	    @wishlist = current_user.wishlist.build(:game_id => params[:game_id])
	    if @wishlist.save
---
INSERT INTO "wishlists" ("game_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["game_id", 1], ["user_id", 1], ["created_at", "2016-09-24 17:20:12.086670"], ["updated_at", "2016-09-24 17:20:12.086670"]]